//Дан двумерный массив А, размеров (n,n)(или квадратная матрица А). 
//Найти среднее геометрическое положительных элементов верхней стреугольной матрицы, исключая главную диагональ.

public class ZD4 {
    public static void main(String[] args) {
        int n = 0;
        int[][] A = {
                {2, 3, 1, 3, 1, 2},
                {3, 1, -4, 6, 4, 2},
                {6, 3, 5, 2, 8, 1},
                {2, 3, 1, 3, 1, 2},
                {3, 1, 4, 6, 4, -2},
                {6, 3, 5, 2, 8, 1}};
        int s = A[0][1];

       for(int g = 2; g < A.length; g++){
            for(int i = 0; i < g - 1; i++){
                if(A[i][g] > 0){
                    n += 1;
                    s *= A[i][g];
                }
            }
        }
        double result = Math.pow(s, n);
        System.out.println("Результат = " + result);
    }   
}
