//Реализовать программу,получающую на вход в качестве аргумента имя человека и выводящую ”Hello ” + имя, в противном случае, если параметр не передавался, ”Hello world”.

public class ZD1 {
    public static void name(String[] args) {
        for (var ZD1: args)  {
            System.out.println("Hello " + args[0]);
        }
    }
    
}
